In [1]:
#pandas dataframeler icin hizli ve etkili 
#csv ve text dosyalarına acıp inceleyip sonuclarımızı da bu dosya tiplerine rahat bir sekilde kaydedebiliriz.
#missing data icin pandas isimizi kolaylastiriyor.
#reshape yapıp datayı daha hızlı bir sekilde kullanabiliriz.
#slicing indexing kolay
#times series data analizinde çok yardımcı 
#en önemlisi hız acısından optimize edilmis hizli bir kutuphane olması.

In [2]:
import pandas as pd

In [32]:
dictionary={"NAME":["beste","arda","burak","zehra","gorkem","arba"],
            "AGE":[25,31,20,28,21,1],
            "MAAS":[900,850,200,450,150,0]}
dataFrame1=pd.DataFrame(dictionary)

In [33]:
head=dataFrame1.head() #dataframe icindeki ilk 5 satırı göster demek..
head

     NAME  AGE  MAAS
0   beste   25   900
1    arda   31   850
2   burak   20   200
3   zehra   28   450
4  gorkem   21   150

In [34]:
tail=dataFrame1.tail() #son 5 satırı gösterir 
tail

     NAME  AGE  MAAS
1    arda   31   850
2   burak   20   200
3   zehra   28   450
4  gorkem   21   150
5    arba    1     0

In [35]:
uc=dataFrame1.head(3) #ilk 3 satırı göstermek icin kullanırız

In [36]:
uc

    NAME  AGE  MAAS
0  beste   25   900
1   arda   31   850
2  burak   20   200

In [37]:
#PANDAS BASIC METHOD

In [38]:
print(dataFrame1.columns) #sutunların isimlerini verir

Index(['NAME', 'AGE', 'MAAS'], dtype='object')

In [39]:
print(dataFrame1.info())
#0'dan 5. indexe kadar 6 tane örnek oldugu, 3 tane column oldugunu 
#age'de 6 tane deger var hicbiri bos degil ve turu int 
#name'de 6 tane bos olmayan deger var ve turu object(string)
#data types: iki tane int bir tane object var
#memory kullanımını veriyor

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    6 non-null      object
 1   AGE     6 non-null      int64
 2   MAAS    6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes
None

In [40]:
print(dataFrame1.dtypes) #her bir feature'ın turunu yazdırıyor.

NAME    object
AGE      int64
MAAS     int64
dtype: object

In [41]:
print(dataFrame1.describe())
#age ve maas adında iki tane feature var. numeric feature=columns(age,maas)
#count: 6 tane sample var 
#mean: dataframe icinde bulunan tum yasların ortalaması ve tum maasların ortalaması
#min: minimum yas degeri 1 ve minumum maas 0 
#max: maximum yas ve max maas

             AGE       MAAS
count   6.000000    6.00000
mean   21.000000  425.00000
std    10.639549  377.82271
min     1.000000    0.00000
25%    20.250000  162.50000
50%    23.000000  325.00000
75%    27.250000  750.00000
max    31.000000  900.00000

In [42]:
#INDEXING AND SLICING

In [43]:
print(dataFrame1["NAME"]) #dataframedeki NAME'i aldık

0     beste
1      arda
2     burak
3     zehra
4    gorkem
5      arba
Name: NAME, dtype: object

In [44]:
print(dataFrame1.AGE) #dataframe'deki AGE'ı böyle de alabiliyoruz.

0    25
1    31
2    20
3    28
4    21
5     1
Name: AGE, dtype: int64

In [45]:
dataFrame1["yeni_feature"]=[-1,-2,-3,-4,-5,-6]

In [46]:
print(dataFrame1.loc[:,"AGE"]) #tüm satır, AGE

0    25
1    31
2    20
3    28
4    21
5     1
Name: AGE, dtype: int64

In [47]:
print(dataFrame1.loc[:3,"AGE"]) #0. indexten 3. indexe kadar al. #NUMPY'DE 3 DAHIL OLMUYORDU FAKAT BURDA DAHIL

0    25
1    31
2    20
3    28
Name: AGE, dtype: int64

In [50]:
print(dataFrame1.loc[:2,"NAME":"MAAS"]) #0. indexten 2 dahil, name'den maasa kadar yazdır.

    NAME  AGE  MAAS
0  beste   25   900
1   arda   31   850
2  burak   20   200

In [51]:
print(dataFrame1.loc[:3,["NAME","MAAS"]]) #0. indexten 3 dahil al name ve maas'ı.

    NAME  MAAS
0  beste   900
1   arda   850
2  burak   200
3  zehra   450

In [53]:
print(dataFrame1.loc[::-1,:])#tersten yazdırma, tüm sutun

     NAME  AGE  MAAS  yeni_feature
5    arba    1     0            -6
4  gorkem   21   150            -5
3   zehra   28   450            -4
2   burak   20   200            -3
1    arda   31   850            -2
0   beste   25   900            -1

In [54]:
print(dataFrame1.loc[:,::-1])

   yeni_feature  MAAS  AGE    NAME
0            -1   900   25   beste
1            -2   850   31    arda
2            -3   200   20   burak
3            -4   450   28   zehra
4            -5   150   21  gorkem
5            -6     0    1    arba

In [55]:
dataFrame1

     NAME  AGE  MAAS  yeni_feature
0   beste   25   900            -1
1    arda   31   850            -2
2   burak   20   200            -3
3   zehra   28   450            -4
4  gorkem   21   150            -5
5    arba    1     0            -6

In [56]:
print(dataFrame1.loc[:,:"AGE"])#tum satir, 0. indexten "NAME" dahil

     NAME  AGE
0   beste   25
1    arda   31
2   burak   20
3   zehra   28
4  gorkem   21
5    arba    1

In [57]:
#loc string/object iloc ise int anlamında

In [58]:
print(dataFrame1.iloc[:,2]) #tüm satır, 2.index

0    900
1    850
2    200
3    450
4    150
5      0
Name: MAAS, dtype: int64

In [59]:
#FILTERING

In [60]:
filtre1=dataFrame1.MAAS> 200

In [62]:
filtre1

0     True
1     True
2    False
3     True
4    False
5    False
Name: MAAS, dtype: bool

In [63]:
type(filtre1)

pandas.core.series.Series

In [64]:
filtrelenmis_data=dataFrame1[filtre1]

In [65]:
filtrelenmis_data

    NAME  AGE  MAAS  yeni_feature
0  beste   25   900            -1
1   arda   31   850            -2
3  zehra   28   450            -4

In [68]:
filtre2=dataFrame1.AGE <26

In [69]:
dataFrame1[filtre1&filtre2]

    NAME  AGE  MAAS  yeni_feature
0  beste   25   900            -1

In [71]:
print(dataFrame1[dataFrame1.AGE>30])

   NAME  AGE  MAAS  yeni_feature
1  arda   31   850            -2

In [72]:
#List Comprehension

In [74]:
ortalama_maas=dataFrame1.MAAS.mean() #pandas feature'un ortalamasını bulma

In [75]:
print(ortalama_maas)

425.0

In [77]:
import numpy as np 
ortalama_maas_np=np.mean(dataFrame1.MAAS)
print(ortalama_maas_np)

425.0

In [80]:
dataFrame1["maas_seviyesi"]=["dusuk" if ortalama_maas>each else "yuksek" for each in dataFrame1.MAAS]

In [81]:
dataFrame1.head()

     NAME  AGE  MAAS  yeni_feature maas_seviyesi
0   beste   25   900            -1        yuksek
1    arda   31   850            -2        yuksek
2   burak   20   200            -3         dusuk
3   zehra   28   450            -4        yuksek
4  gorkem   21   150            -5         dusuk

In [84]:
for each in dataFrame1.MAAS:
    if ortalama_maas>each:
        print("dusuk")
    else:
        print("yuksek")

yuksek
yuksek
dusuk
yuksek
dusuk
dusuk

In [91]:
a="ARDA"
a.lower()#buyuk harfleri kucuk harf yapar
a="ArDa"
a.lower()

'arda'

In [87]:
dataFrame1.columns=[each.lower() for each in dataFrame1.columns] #dataframe icindeki featureları kucuk harf yapıldı.

In [90]:
dataFrame1.columns

Index(['name', 'age', 'maas', 'yeni_feature', 'maas_seviyesi'], dtype='object')

In [92]:
b="Burak Orhan" #eger bosluk varsa bir liste icine iki ayrı eleman olarak koyuyor
b.split()

['Burak', 'Orhan']

In [95]:
dataFrame1.columns=[each.split()[0]+"_"+each.split()[1] if len(each.split()) >1  else each  for each in dataFrame1.columns]

In [96]:
dataFrame1.columns

Index(['name', 'age', 'maas', 'yeni_feature', 'maas_seviyesi'], dtype='object')

In [97]:
#DROP AND CONCATENATING

In [98]:
dataFrame1.drop(["yeni_feature"],axis=1,inplace=True) 
#dropta eger axis=0 dersek satır drop eder axis=1 dersek sutun drop edilir
#inplace kullanma amacımız:
#dataFrame1=dataFrame1.drop(["yeni_feature"],axis=1,inplace=True) #eşitleme işlemini yapmamak

In [99]:
dataFrame1.head()

     name  age  maas maas_seviyesi
0   beste   25   900        yuksek
1    arda   31   850        yuksek
2   burak   20   200         dusuk
3   zehra   28   450        yuksek
4  gorkem   21   150         dusuk

In [100]:
data1=dataFrame1.head()
data2=dataFrame1.tail()
#vertical
data_concat=pd.concat([data1,data2],axis=0) #concat birleştirmek icin kullanılır ilk bes ve son bes veriyi birlestirdik
#axis=0 yukarıdan asagıya

In [101]:
data1

     name  age  maas maas_seviyesi
0   beste   25   900        yuksek
1    arda   31   850        yuksek
2   burak   20   200         dusuk
3   zehra   28   450        yuksek
4  gorkem   21   150         dusuk

In [106]:
#horizontal

In [108]:
maas=dataFrame1.maas
age=dataFrame1.age
data_h_concat=pd.concat([maas,age],axis=1)
data_h_concat 
#yan yana birlestirme islemi gerceklestirdik axis=0 olsaydı dıger sutunu altına koyardı

   maas  age
0   900   25
1   850   31
2   200   20
3   450   28
4   150   21
5     0    1

In [112]:
dataFrame1["list_comp"]=[each*2 for each in dataFrame1.age]

In [113]:
dataFrame1["list_comp"]

0    50
1    62
2    40
3    56
4    42
5     2
Name: list_comp, dtype: int64

In [114]:
#apply
def multiply(age):
    return age*2
dataFrame1["apply_methodu"]=dataFrame1.age.apply(multiply)
#dataframe.age'deki degerlerin hepsine yazdıgımız fonksiyonu uyguladı.

In [115]:
dataFrame1["apply_methodu"]

0    50
1    62
2    40
3    56
4    42
5     2
Name: apply_methodu, dtype: int64

In [116]:
dataFrame1.head()

     name  age  maas maas_seviyesi  list_comp  apply_methodu
0   beste   25   900        yuksek         50             50
1    arda   31   850        yuksek         62             62
2   burak   20   200         dusuk         40             40
3   zehra   28   450        yuksek         56             56
4  gorkem   21   150         dusuk         42             42